<template>
  <Layout
    color="#389F9A"
    page="Explore"
    title="ตีแผ่ข้อมูลกรุงเทพ"
    subtitle="งบประมาณกรุงเทพทั้งภาพรวมและเจาะประเด็นรายเขต"
  >
    <div class="text-center">
      <div>
        <h1 class="font-bold">
          งบเพิ่มขึ้นทุกปี แต่กรุงเทพดีขึ้นจริง ๆ รึเปล่า
        </h1>
        <p>งบประมาณกรุงเทพเพิ่มขึ้นทุกๆ ปี</p>
        <p>งบในปี 2563 เพิ่มขึ้นจากปีก่อนหน้านั้น ร้อยละ 3%</p>
        <p>หรือประมาณ 3,000 ล้านบาท</p>
        <p />
        <p>
          แต่คนกรุงเทพจริงๆ รู้สึกว่าเมืองของเราถูกพัฒนาให้ดีขึ้น ทุกๆ
          ปีจริงหรือเปล่า?
        </p>
        <p />
        <h6 class="text-xs text-gray-500">(กดปุ่ม Replay เพื่อเล่น)</h6>
        <iframe
          src="https://flo.uri.sh/visualisation/3714420/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>

      <div>
        <h1 class="font-bold">งบประมาณกรุงเทพทั้งภาพรวมและเจาะประเด็นรายเขต</h1>
        <p>งบประมาณกรุงเทพฯ ในปี พ.ศ. 2563 ตั้งงบประมาณรายจ่ายไว้ทั้งหมด</p>
        <p />
        <h2 class="text-2xl">83,398,006,000 บาท</h2>
        <p />
        <p>
          สำนักที่ได้งบประมาณเยอะที่สุดคือ สำนักโยธา 9,229 ล้านบาท (11%
          ของงบทั้งหมด)
        </p>
        <p>
          แผนงานที่ได้งบประมาณไปมากที่สุดคือ แผนงานรักษาความสะอาด 5,955 ล้านบาท
          (7% ของงบทั้งหมด)
        </p>
        <p />
        <h6 class="text-xs text-gray-500">
          (กดที่วงกลมด้านล่างเพื่อดูรายละเอียด)
        </h6>
        <iframe
          src="https://flo.uri.sh/visualisation/3720091/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>

      <div>
        <h1 class="font-bold">เขตไหนได้งบประมาณมากที่สุด?</h1>
        <p>กรุงเทพฯ มีทั้งหมด 50 เขต</p>
        <p>โดยที่ถ้าดูการแบ่งงบประมาณที่ได้ตามรายเขตแล้ว</p>
        <p>เขตที่ได้งบประมาณมากที่สุดคือ</p>
        <p />
        <h2 class="text-2xl">เขต ประเวศ</h2>
        <h2 class="text-2xl">5,848 ล้านบาท (xx% ของงบทั้งหมด)</h2>
        <p />
        <p>ถ้าสังเกตดี ๆ เขตกรุงเทพชั้นนอกจะได้งบประมาณมากกว่ากรุงเทพชั้นใน</p>
        <p />
        <h6 class="text-xs text-gray-500">
          (กดที่แผนที่ด้านล่างเพื่อดูรายละเอียด
        </h6>
        <h6 class="text-xs text-gray-500">
          เขตที่ได้งบเยอะจะมีสีน้ำเงินที่เข้มกว่า)
        </h6>
        <p />
        <iframe
          src="https://flo.uri.sh/visualisation/3715123/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>

      <div>
        เราลงทุนกับการสร้างอาคาร ปรับปรุงถนน กรุงเทพฯ ใช้งบประมาณจำนวน x,xxx
        ล้านบาทเพื่อแผนการโยธา คิดเป็น xx% ของงบประทั้งหมด โดยที่แผนการโยธาคือ
        โครงการปรับปรุงก่อสร้างอาคาร ถนน สะพานต่าง ๆ และเมื่อดูตามรายเขต
        เขตที่ได้งบประมาณเยอะที่สุดคือ เขต ประเวศ 1,337 ล้านบาท (xx%
        ของงบทั้งหมด) (กดที่แผนที่ด้านล่างเพื่อดูรายละเอียด
        เขตที่ได้งบเยอะจะมีสีน้ำเงินที่เข้มกว่า)
        <iframe
          src="https://flo.uri.sh/visualisation/3721052/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>

      <div>
        เมืองแห่งความสะอาด กรุงเทพฯ ใช้งบประมาณจำนวน x,xxx
        ล้านบาทเพื่อแผนงานรักษาความสะอาด คิดเป็น xx% ของงบประทั้งหมด เช่น
        โครงการที่เกี่ยวข้องกับการกำจัดขยะมูลฝอย บำบัดน้ำเสีย
        และเมื่อดูตามรายเขต เขตที่ได้งบประมาณเยอะที่สุดคือ เขต จตุจักร 2,362
        ล้านบาท (xx% ของงบทั้งหมด) เขตที่ได้น้อยที่สุด คือ เขตภาษีเจริญ ได้ไป
        1,111 ล้านบาท (xx% ของงบทั้งหมด) (กดที่แผนที่ด้านล่างเพื่อดูรายละเอียด
        เขตที่ได้งบเยอะจะมีสีน้ำเงินที่เข้มกว่า)

        <iframe
          src="https://flo.uri.sh/visualisation/3721123/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>

      <div>
        ฝนตก น้ำไม่ท่วม? กรุงเทพฯ
        มีงบในการจัดการเรื่องระบายน้ำและการแก้ไขปัญหาน้ำท่วมโดยเฉพาะ
        เป็นงบทั้งหมด xxxxx บาท xx% ของงบทั้งหมด
        เขตที่ได้งบประมาณแผนการระบายน้ำและการแก้ไขปัญหาน้ำท่วมมากที่สุดคือ เขต
        บางกอกน้อย 5,063 ล้านบาท (xx% ของงบทั้งหมด)
        (กดที่แผนที่ด้านล่างเพื่อดูรายละเอียด
        เขตที่ได้งบเยอะจะมีสีน้ำเงินที่เข้มกว่า)
        <iframe
          src="https://flo.uri.sh/visualisation/3721132/embed"
          frameborder="0"
          scrolling="no"
          style="width:100%;height:800px;"
          aria-label
        ></iframe>
      </div>
    </div>
  </Layout>
</template>

<script>
import Layout from "../layouts/default";

export default {
  components: {
    Layout
  }
};
</script>
